import mongoose from "mongoose";
import News from "./models/News.js";

const uri = 'mongodb+srv://dianasem0911:dianaFox0903*@cluster0.le4k4rz.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0'; 

const createNews = async () => {
    const newsArray = [
      {
        title: 'Національний музей українського гончарства, Опішня',
        description: 'Музей представив унікальну виставку відомого художника. Виставка включає більше 100 робіт, що відображають різні етапи творчого шляху митця. Відвідувачі зможуть побачити як ранні ескізи, так і новітні інсталяції. Експозиція буде відкрита для відвідувачів протягом трьох місяців, а на її честь планується провести серію лекцій та майстер-класів.',
        photoUrl: 'https://ua.igotoworld.com/frontend/webcontent/websites/1/images/gallery/6862_800x600_Muzei%20Oposhnja.jpg',
      },
      {
        title: 'Музей-заповідник Миколи Гоголя, Гоголеве',
        description: 'Старовинний музей мистецтв розпочав реставраційні роботи над важливими історичними картинами. В рамках проекту, що фінансується міжнародною організацією, реставратори працюють над відновленням кольорів та структури полотен, які постраждали від часу та умов зберігання. Музей планує організувати відкриті дні, щоб відвідувачі могли побачити процес реставрації на власні очі.',
        photoUrl: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/33256',
      },
      {
        title: 'Музей-садиба Івана Котляревського, Полтава',
        description: 'Музей мистецтв організовує щорічний фестиваль місцевої культури з виставками та майстер-класами. Захід об’єднає художників, ремісників, музикантів та письменників, які представлять свої роботи та проведуть інтерактивні заняття для відвідувачів. Фестиваль також включатиме виступи місцевих музичних гуртів, театральні постановки та кулінарні демонстрації традиційної кухні',
        photoUrl: 'https://mus.pl.ua/tour/wp-content/uploads/2021/06/muzej-poltava-1.jpg',
      },
      {
        title: 'Краєзнавчий музей імені Василя Кричевського, Полтава',
        description: 'Музей історії міста відзначив 100-річчя з моменту свого заснування з великим святкуванням та спеціальними подіями. Програма святкування включала в себе театралізовані вистави, історичні реконструкції та інтерактивні екскурсії. На честь ювілею було також презентовано новий зал, присвячений історії розвитку міста протягом останнього століття.',
        photoUrl: 'https://findandfollow.com.ua/wp-content/uploads/2021/12/IMG_0012--scaled.jpg',
      },
      {
        title: 'Літературно-меморіальний музей Миколи Гоголя, Великі Сорочинці',
        description: 'Музей театрального мистецтва презентує серію інтерактивних вистав, де глядачі можуть стати учасниками подій. Це новий формат вистав, який дозволяє відвідувачам зануритися в атмосферу минулих епох та відчути себе частиною театральної історії.',
        photoUrl: 'https://museum-portal.com/content/museums/26/literaturno-memorialniy-muzey-m-v--gogolya_standard.webp',
      },
      {
        title: 'Меморіальний музей-садиба Пошивайлів, Опішня',
        description: 'Оголошено про спеціальні знижки для студентів. Молодь зможе відвідувати музей за пільговими тарифами та брати участь у освітніх програмах, організованих музеєм.',
        photoUrl: 'https://opishne-museum.gov.ua/wp-content/uploads/2020/05/foto1-1350x900.jpg',
      },
      {
        title: 'Літературно-меморіальний музей Д. Гурамішвілі, Миргород',
        description: 'Музей відкриває виставку робіт молодих талановитих митців з регіону. Виставка включає живопис, скульптуру та фотографію, які відображають сучасне мистецтво та проблеми, що хвилюють суспільство',
        photoUrl: 'https://aws-travel-guide.s3.eu-west-1.amazonaws.com/default_image_size/611143830abc0_%D0%9C%D1%83%D0%B7%D0%B5%D0%B9%20%D0%93%D1%83%D1%80%D0%B0%D0%BC%D1%8B%D1%88%D0%B2%D1%8B%D0%BB%D1%8B.jpg',
      },
      {
        title: 'Краєзнавчий музей, Лубни',
        description: 'Великі музеї країни впроваджують нові цифрові технології для покращення взаємодії з відвідувачами. Відтепер доступні віртуальні тури, інтерактивні гіди та додатки з доповненою реальністю, які дозволяють зануритися в історію експонатів.',
        photoUrl: 'https://esu.com.ua/images/galleries-images/18tom/lubensykiy%20kraeznavchiy%20muzey/budivlya%20muzeyu.jpg',
      },
      {
        title: 'Полтавський художній музей',
        description: 'Музей мистецтв радісно оголошує про відкриття нової виставки під назвою "Сучасний Погляд", де буде представлено колекцію нових картин від відомих сучасних художників.',
        photoUrl: 'https://upload.wikimedia.org/wikipedia/uk/b/b5/%D0%9F%D0%BE%D0%BB%D1%82%D0%B0%D0%B2%D1%81%D1%8C%D0%BA%D0%B8%D0%B9_%D1%85%D1%83%D0%B4%D0%BE%D0%B6%D0%BD%D1%96%D0%B9_%D0%BC%D1%83%D0%B7%D0%B5%D0%B9.jpg',
      },
      {
        title: 'Музей авіації і космонавтики імені Ю. Кондратюка, Полтава',
        description: 'Музей театрального мистецтва презентує серію інтерактивних вистав, де глядачі можуть стати учасниками подій. Це новий формат вистав, який дозволяє відвідувачам зануритися в атмосферу минулих епох та відчути себе частиною театральної історії.',
        photoUrl: 'https://ua.igotoworld.com/frontend/webcontent/websites/1/images/gallery/12419_800x600_0_98d61_550a69ff_XL.jpg',
      },
      
    ];
  
    try {
      // Підключення до бази даних
      await mongoose.connect(uri, {
        useNewUrlParser: true,
        useUnifiedTopology: true,
      });
  
      // Вставка новин у базу даних
      const savedNews = await News.insertMany(newsArray);
      console.log('News saved successfully:', savedNews);
    } catch (error) {
      console.error('Error saving news:', error);
    } finally {
      // Закриття з'єднання з базою даних
      await mongoose.connection.close();
    }
  };
  
  createNews();